Revit 2026 API
LinePattern Methods
The LinePattern type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSegments |  Gets the sequence of segments that defines this line pattern.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetSegments
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
LinePattern Class
Autodesk.Revit.DB Namespace